{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": " <|findelteorema|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": " "
    },
    "behavior": "MergedWithNext",
    "invert": false
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      " <|findelteorema|>": 4,
      "\n": 5,
      " ": 6,
      "!": 7,
      "\"": 8,
      "#": 9,
      "$": 10,
      "%": 11,
      "&": 12,
      "'": 13,
      "(": 14,
      ")": 15,
      "*": 16,
      "+": 17,
      ",": 18,
      "-": 19,
      ".": 20,
      "/": 21,
      "0": 22,
      "1": 23,
      "2": 24,
      "3": 25,
      "4": 26,
      "5": 27,
      "6": 28,
      "7": 29,
      "8": 30,
      "9": 31,
      ":": 32,
      ";": 33,
      "<": 34,
      "=": 35,
      ">": 36,
      "?": 37,
      "@": 38,
      "A": 39,
      "B": 40,
      "C": 41,
      "D": 42,
      "E": 43,
      "F": 44,
      "G": 45,
      "H": 46,
      "I": 47,
      "J": 48,
      "K": 49,
      "L": 50,
      "M": 51,
      "N": 52,
      "O": 53,
      "P": 54,
      "Q": 55,
      "R": 56,
      "S": 57,
      "T": 58,
      "U": 59,
      "V": 60,
      "W": 61,
      "X": 62,
      "Y": 63,
      "Z": 64,
      "[": 65,
      "\\": 66,
      "]": 67,
      "^": 68,
      "_": 69,
      "`": 70,
      "a": 71,
      "b": 72,
      "c": 73,
      "d": 74,
      "e": 75,
      "f": 76,
      "g": 77,
      "h": 78,
      "i": 79,
      "j": 80,
      "k": 81,
      "l": 82,
      "m": 83,
      "n": 84,
      "o": 85,
      "p": 86,
      "q": 87,
      "r": 88,
      "s": 89,
      "t": 90,
      "u": 91,
      "v": 92,
      "w": 93,
      "x": 94,
      "y": 95,
      "z": 96,
      "{": 97,
      "|": 98,
      "}": 99,
      "~": 100,
      "«": 101,
      "¬": 102,
      "²": 103,
      "³": 104,
      "·": 105,
      "¹": 106,
      "»": 107,
      "×": 108,
      "ʷ": 109,
      "ʸ": 110,
      "ˢ": 111,
      "ˣ": 112,
      "̂": 113,
      "Γ": 114,
      "Δ": 115,
      "Θ": 116,
      "Ι": 117,
      "Λ": 118,
      "Π": 119,
      "Σ": 120,
      "Φ": 121,
      "Ψ": 122,
      "Ω": 123,
      "α": 124,
      "β": 125,
      "γ": 126,
      "δ": 127,
      "ε": 128,
      "ζ": 129,
      "η": 130,
      "θ": 131,
      "ι": 132,
      "κ": 133,
      "λ": 134,
      "μ": 135,
      "ν": 136,
      "ξ": 137,
      "π": 138,
      "ρ": 139,
      "σ": 140,
      "τ": 141,
      "υ": 142,
      "φ": 143,
      "χ": 144,
      "ψ": 145,
      "ω": 146,
      "ϕ": 147,
      "ϖ": 148,
      "ᗮ": 149,
      "ᘁ": 150,
      "ᴬ": 151,
      "ᴴ": 152,
      "ᴸ": 153,
      "ᵀ": 154,
      "ᵁ": 155,
      "ᵃ": 156,
      "ᵇ": 157,
      "ᵈ": 158,
      "ᵉ": 159,
      "ᵍ": 160,
      "ᵐ": 161,
      "ᵒ": 162,
      "ᵖ": 163,
      "ᵛ": 164,
      "ᵢ": 165,
      "ᵣ": 166,
      "ᵤ": 167,
      "ᵥ": 168,
      "ᶜ": 169,
      "ᶠ": 170,
      "‖": 171,
      "†": 172,
      "•": 173,
      "′": 174,
      "‹": 175,
      "›": 176,
      "‼": 177,
      "⁄": 178,
      "⁅": 179,
      "⁆": 180,
      "⁰": 181,
      "ⁱ": 182,
      "⁴": 183,
      "⁵": 184,
      "⁶": 185,
      "⁸": 186,
      "⁺": 187,
      "⁻": 188,
      "ⁿ": 189,
      "₀": 190,
      "₁": 191,
      "₂": 192,
      "₃": 193,
      "₄": 194,
      "₅": 195,
      "₆": 196,
      "₇": 197,
      "₈": 198,
      "₉": 199,
      "₊": 200,
      "ₐ": 201,
      "ₑ": 202,
      "ₒ": 203,
      "ₓ": 204,
      "ₕ": 205,
      "ₖ": 206,
      "ₗ": 207,
      "ₘ": 208,
      "ₙ": 209,
      "ₚ": 210,
      "ₛ": 211,
      "ₜ": 212,
      "ℂ": 213,
      "ℍ": 214,
      "ℐ": 215,
      "ℑ": 216,
      "ℒ": 217,
      "ℓ": 218,
      "ℕ": 219,
      "ℙ": 220,
      "ℚ": 221,
      "ℜ": 222,
      "ℝ": 223,
      "ℤ": 224,
      "ℬ": 225,
      "ℰ": 226,
      "ℱ": 227,
      "ℳ": 228,
      "ℵ": 229,
      "⅟": 230,
      "←": 231,
      "↑": 232,
      "→": 233,
      "↓": 234,
      "↔": 235,
      "↗": 236,
      "↟": 237,
      "↥": 238,
      "↦": 239,
      "↪": 240,
      "↾": 241,
      "↿": 242,
      "⇑": 243,
      "⇒": 244,
      "⇔": 245,
      "⇨": 246,
      "∀": 247,
      "∂": 248,
      "∃": 249,
      "∅": 250,
      "∆": 251,
      "∇": 252,
      "∈": 253,
      "∉": 254,
      "∏": 255,
      "∐": 256,
      "∑": 257,
      "∗": 258,
      "∘": 259,
      "∙": 260,
      "√": 261,
      "∞": 262,
      "∠": 263,
      "∡": 264,
      "∣": 265,
      "∤": 266,
      "∥": 267,
      "∧": 268,
      "∨": 269,
      "∩": 270,
      "∪": 271,
      "∫": 272,
      "∮": 273,
      "∯": 274,
      "∼": 275,
      "≃": 276,
      "≅": 277,
      "≈": 278,
      "≌": 279,
      "≠": 280,
      "≡": 281,
      "≤": 282,
      "≥": 283,
      "≪": 284,
      "≫": 285,
      "≺": 286,
      "≼": 287,
      "⊂": 288,
      "⊆": 289,
      "⊇": 290,
      "⊓": 291,
      "⊔": 292,
      "⊕": 293,
      "⊗": 294,
      "⊙": 295,
      "⊚": 296,
      "⊞": 297,
      "⊢": 298,
      "⊣": 299,
      "⊤": 300,
      "⊥": 301,
      "⊨": 302,
      "⊻": 303,
      "⊼": 304,
      "⋀": 305,
      "⋂": 306,
      "⋃": 307,
      "⋆": 308,
      "⋈": 309,
      "⋊": 310,
      "⋖": 311,
      "⋙": 312,
      "⋯": 313,
      "⌈": 314,
      "⌉": 315,
      "⌊": 316,
      "⌋": 317,
      "⍟": 318,
      "□": 319,
      "▷": 320,
      "▸": 321,
      "◁": 322,
      "◃": 323,
      "○": 324,
      "◫": 325,
      "♯": 326,
      "✝": 327,
      "✶": 328,
      "⟂": 329,
      "⟦": 330,
      "⟧": 331,
      "⟨": 332,
      "⟩": 333,
      "⟪": 334,
      "⟫": 335,
      "⟮": 336,
      "⟯": 337,
      "⟶": 338,
      "⟹": 339,
      "⤳": 340,
      "⥤": 341,
      "⦃": 342,
      "⦄": 343,
      "⧏": 344,
      "⧸": 345,
      "⨁": 346,
      "⨂": 347,
      "⨅": 348,
      "⨆": 349,
      "⨍": 350,
      "⨯": 351,
      "⨳": 352,
      "⨿": 353,
      "⩿": 354,
      "⬝": 355,
      "￢": 356,
      "𝐒": 357,
      "𝐞": 358,
      "𝑳": 359,
      "𝑹": 360,
      "𝒄": 361,
      "𝒅": 362,
      "𝒜": 363,
      "𝒞": 364,
      "𝒟": 365,
      "𝒢": 366,
      "𝒪": 367,
      "𝒫": 368,
      "𝒮": 369,
      "𝒯": 370,
      "𝒰": 371,
      "𝒱": 372,
      "𝒳": 373,
      "𝒴": 374,
      "𝓐": 375,
      "𝓒": 376,
      "𝓓": 377,
      "𝓕": 378,
      "𝓘": 379,
      "𝓚": 380,
      "𝓜": 381,
      "𝓝": 382,
      "𝓞": 383,
      "𝓟": 384,
      "𝓢": 385,
      "𝓤": 386,
      "𝔖": 387,
      "𝔗": 388,
      "𝔠": 389,
      "𝔭": 390,
      "𝔸": 391,
      "𝔻": 392,
      "𝔼": 393,
      "𝕀": 394,
      "𝕂": 395,
      "𝕄": 396,
      "𝕊": 397,
      "𝕌": 398,
      "𝕎": 399,
      "𝕜": 400,
      "𝕝": 401,
      "𝖣": 402,
      "𝟙": 403,
      "𝟭": 404,
      " :": 405,
      " (": 406,
      "in": 407,
      " h": 408,
      "or": 409,
      "on": 410,
      "em": 411,
      "te": 412,
      "le": 413,
      " [": 414,
      "mp": 415,
      "pe": 416,
      "al": 417,
      " b": 418,
      " :=": 419,
      "de": 420,
      " u": 421,
      "su": 422,
      "ype": 423,
      "orem": 424,
      "ro": 425,
      " T": 426,
      "]\n": 427,
      "fin": 428,
      "se": 429,
      "t_": 430,
      "ma": 431,
      " Type": 432,
      " =": 433,
      "re": 434,
      "ct": 435,
      " <": 436,
      "si": 437,
      "f_": 438,
      " by": 439,
      "th": 440,
      "ul": 441,
      " a": 442,
      " f": 443,
      "rw": 444,
      "lte": 445,
      " by\n": 446,
      "un": 447,
      "co": 448,
      " <|": 449,
      "eq": 450,
      "ly": 451,
      " x": 452,
      " _": 453,
      "ra": 454,
      "ex": 455,
      "is": 456,
      " u_": 457,
      "simp": 458,
      "mul": 459,
      "|>": 460,
      "a|>": 461,
      "delte": 462,
      "orema|>": 463,
      "findelte": 464,
      " <|findelte": 465,
      "if": 466,
      "t.": 467,
      "e_": 468,
      "ri": 469,
      "d_": 470,
      " n": 471,
      " α": 472,
      " i": 473,
      "eq_": 474,
      "ap": 475,
      "ve": 476,
      " S": 477,
      "of_": 478,
      " s": 479,
      "act": 480,
      ").": 481,
      "ca": 482,
      "con": 483,
      "ing": 484,
      "po": 485,
      "to": 486,
      " →": 487,
      "mul_": 488,
      "ze": 489,
      "ea": 490,
      " F": 491,
      "1)": 492,
      " (f": 493,
      "exact": 494,
      " ⟨": 495,
      "le_": 496,
      " M": 497,
      "mem": 498,
      "ti": 499,
      "zero": 500,
      "map": 501,
      "the": 502,
      "om": 503,
      " α)": 504,
      "ne": 505,
      "ge": 506,
      " C": 507,
      "lem": 508,
      "sub": 509,
      "ha": 510,
      "theorem": 511,
      "lemma": 512,
      "s_": 513,
      " =>": 514,
      "iv": 515,
      " R": 516,
      " I": 517,
      "ad": 518,
      "app": 519,
      " p": 520,
      " u_1)": 521,
      "st": 522,
      "iff": 523,
      "mem_": 524,
      " on": 525,
      "apply": 526,
      "mm": 527,
      " *": 528,
      " r": 529,
      ")\n": 530,
      " only": 531,
      "an": 532,
      "easu": 533,
      "int": 534,
      "ran": 535,
      " (α": 536,
      "al.": 537,
      "orm": 538,
      "at": 539,
      "comp": 540,
      " P": 541,
      "fl": 542,
      "_eq_": 543,
      "ith": 544,
      "?_": 545,
      "et": 546,
      " fun": 547,
      "ion": 548,
      "lo": 549,
      " w": 550,
      "⟩\n": 551,
      " y": 552,
      " ?_": 553,
      "inse": 554,
      " 0": 555,
      "sing": 556,
      " L": 557,
      "ce": 558,
      " [←": 559,
      "iff_": 560,
      " E": 561,
      "2)": 562,
      " m": 563,
      " +": 564,
      "du": 565,
      "fine": 566,
      "have": 567,
      "ar": 568,
      "pow": 569,
      "it": 570,
      "gh": 571,
      " t": 572,
      " hx": 573,
      " c": 574,
      " (x": 575,
      "so": 576,
      "gr": 577,
      " N": 578,
      "))": 579,
      " ←": 580,
      "Re": 581,
      " g": 582,
      " (a": 583,
      "al_": 584,
      "er": 585,
      "en": 586,
      " A": 587,
      "neg": 588,
      "intro": 589,
      "In": 590,
      "ist": 591,
      "map_": 592,
      "Su": 593,
      " ∈": 594,
      "as": 595,
      "refine": 596,
      " ℕ": 597,
      " (h": 598,
      " (n": 599,
      " ℝ": 600,
      " at": 601,
      " (s": 602,
      "at.": 603,
      "Co": 604,
      " u_2)": 605,
      " l": 606,
      "cc": 607,
      "add_": 608,
      "_of_": 609,
      " -": 610,
      "_n": 611,
      "lef": 612,
      "ory": 613,
      "ble": 614,
      "easure": 615,
      "ymm": 616,
      "case": 617,
      "inte": 618,
      "one": 619,
      ",\n": 620,
      "cases": 621,
      " v": 622,
      " (b": 623,
      "ta": 624,
      "Map": 625,
      "righ": 626,
      " ↑": 627,
      " ι": 628,
      "ds": 629,
      "uo": 630,
      " H": 631,
      "ction": 632,
      "pro": 633,
      " with": 634,
      " 1": 635,
      " ℕ)": 636,
      " u)": 637,
      "s.": 638,
      " ^": 639,
      "tion": 640,
      "inv": 641,
      " Set": 642,
      " d": 643,
      " β": 644,
      " ≤": 645,
      "ot_": 646,
      " simp": 647,
      "symm": 648,
      " e": 649,
      " rfl": 650,
      " ha": 651,
      "qu": 652,
      "li": 653,
      "Un": 654,
      " using": 655,
      " X": 656,
      "lt_": 657,
      "p_": 658,
      "left": 659,
      " (R": 660,
      " mul_": 661,
      "sum": 662,
      " ↔": 663,
      " Finse": 664,
      " hf": 665,
      "comm": 666,
      " j": 667,
      "r_": 668,
      "coe_": 669,
      " k": 670,
      "ob": 671,
      "Hom": 672,
      "car": 673,
      "et.": 674,
      "let": 675,
      " (p": 676,
      "succ": 677,
      " (fun": 678,
      "this": 679,
      "zero_": 680,
      " [h": 681,
      "ge_": 682,
      "ono": 683,
      "right": 684,
      "sub_": 685,
      "us": 686,
      "ory.": 687,
      "pp": 688,
      "ate": 689,
      "l_": 690,
      "ty": 691,
      "he": 692,
      "id": 693,
      " ((": 694,
      "tin": 695,
      "ext": 696,
      " G": 697,
      "of": 698,
      "ima": 699,
      "add": 700,
      "riv": 701,
      " rw": 702,
      "pow_": 703,
      " |": 704,
      "rable": 705,
      " (F": 706,
      " z": 707,
      "mk": 708,
      "inea": 709,
      "norm": 710,
      "soc": 711,
      "tinuo": 712,
      "De": 713,
      "set": 714,
      "tran": 715,
      " Su": 716,
      "mple": 717,
      "div": 718,
      "ic": 719,
      " Is": 720,
      "mo": 721,
      " Nat.": 722,
      ".2": 723,
      "inear": 724,
      "To": 725,
      "ten": 726,
      "),": 727,
      "ect": 728,
      " B": 729,
      "sel": 730,
      " h\n": 731,
      "ver": 732,
      "congr": 733,
      "The": 734,
      ".1": 735,
      "3)": 736,
      " ℝ)": 737,
      "Theory.": 738,
      "pa": 739,
      " this": 740,
      " K": 741,
      "ru": 742,
      "mul,": 743,
      "bra": 744,
      "ilte": 745,
      "pen": 746,
      "set_": 747,
      " u_3)": 748,
      "pos": 749,
      " Sub": 750,
      "gebra": 751,
      " /": 752,
      "coe": 753,
      " μ": 754,
      "On": 755,
      " Measure": 756,
      " (M": 757,
      "ite": 758,
      " (g": 759,
      "lt": 760,
      "quiv": 761,
      "exist": 762,
      "_apply": 763,
      "dsto": 764,
      "st_": 765,
      "With": 766,
      "assoc": 767,
      "Fun": 768,
      "ject": 769,
      " hs": 770,
      " R)": 771,
      "Sub": 772,
      " ↦": 773,
      " ∀": 774,
      "simp\n": 775,
      "one_": 776,
      "simpa": 777,
      "trans": 778,
      "di": 779,
      "dule": 780,
      " {": 781,
      " (i": 782,
      "log": 783,
      " Finset.": 784,
      " •": 785,
      " β)": 786,
      "tain": 787,
      "obtain": 788,
      ".to": 789,
      " x)": 790,
      "dd": 791,
      " hp": 792,
      " (m": 793,
      " O": 794,
      "up": 795,
      " (β": 796,
      "me": 797,
      " Set.": 798,
      "mono": 799,
      "rfl": 800,
      "easurable": 801,
      " 1)": 802,
      " mem_": 803,
      "Real.": 804,
      "emp": 805,
      "val": 806,
      "oc": 807,
      "omi": 808,
      " (E": 809,
      " in": 810,
      " C)": 811,
      "empty": 812,
      "non": 813,
      "tinuous": 814,
      "ot": 815,
      "',": 816,
      " 2": 817,
      " (c": 818,
      "exists_": 819,
      " hy": 820,
      " V": 821,
      "supp": 822,
      "ctor": 823,
      "asi": 824,
      "smul_": 825,
      "Equiv": 826,
      "ali": 827,
      " E)": 828,
      " hi": 829,
      " (C": 830,
      "iff,": 831,
      "jo": 832,
      "subset_": 833,
      " ?_\n": 834,
      "Is": 835,
      "NN": 836,
      "leton": 837,
      "x.": 838,
      " Fin": 839,
      " 𝕜": 840,
      "self": 841,
      " (S": 842,
      "d.": 843,
      " ad": 844,
      " le_": 845,
      " hb": 846,
      ";>": 847,
      " <;>": 848,
      ".in": 849,
      "or_": 850,
      "ne_": 851,
      "im": 852,
      "ive": 853,
      " i)": 854,
      "pan": 855,
      "zero,": 856,
      "top": 857,
      "ateg": 858,
      "Inte": 859,
      "_rw": 860,
      "gre": 861,
      "Se": 862,
      " (X": 863,
      "all": 864,
      "comp_": 865,
      " hn": 866,
      " ≫": 867,
      "const": 868,
      "inearMap": 869,
      "jective": 870,
      "sum_": 871,
      "⁻¹": 872,
      "range": 873,
      " (ι": 874,
      "s,": 875,
      " q": 876,
      "ilter": 877,
      " exact": 878,
      " ∃": 879,
      "tendsto": 880,
      " ∧": 881,
      ".symm": 882,
      "ch": 883,
      "inv_": 884,
      "il": 885,
      " ‖": 886,
      "singleton": 887,
      "gral_": 888,
      "nomi": 889,
      "lynomi": 890,
      " _\n": 891,
      " Y": 892,
      "hom": 893,
      "y_": 894,
      "Pro": 895,
      "card_": 896,
      " In": 897,
      ".map_": 898,
      "pre": 899,
      " M)": 900,
      " v)": 901,
      " D": 902,
      "um": 903,
      "type": 904,
      " add_": 905,
      "rcases": 906,
      "univ": 907,
      "module": 908,
      " (y": 909,
      "ation": 910,
      " n)": 911,
      "nat": 912,
      "oo": 913,
      "ist.": 914,
      "rintro": 915,
      "ci": 916,
      "nce": 917,
      " ι)": 918,
      "ie": 919,
      " con": 920,
      "Iso": 921,
      "stri": 922,
      "fun": 923,
      " (t": 924,
      "prod_": 925,
      "card": 926,
      "olynomi": 927,
      "Within": 928,
      "ff": 929,
      " ⟶": 930,
      "image_": 931,
      "nt": 932,
      "NNReal.": 933,
      "lim": 934,
      "dis": 935,
      "simp_rw": 936,
      "Nat.": 937,
      ".re": 938,
      " (A": 939,
      " (μ": 940,
      "ulti": 941,
      "ble_": 942,
      " Categ": 943,
      "image": 944,
      "Of": 945,
      "Deriv": 946,
      "Con": 947,
      "div_": 948,
      "Union": 949,
      "atri": 950,
      "ph": 951,
      "eg": 952,
      "4)": 953,
      "ort": 954,
      " W": 955,
      "wo": 956,
      "not_": 957,
      " (l": 958,
      "ally": 959,
      "clo": 960,
      "cast_": 961,
      "pi": 962,
      "def": 963,
      "ift": 964,
      "pace": 965,
      " ht": 966,
      ".mp": 967,
      "rfl\n": 968,
      " Pro": 969,
      " u_4)": 970,
      ".map": 971,
      "join": 972,
      " _)": 973,
      "_s": 974,
      "ir": 975,
      " (I": 976,
      "igh": 977,
      " (G": 978,
      "duction": 979,
      "x,": 980,
      "algebra": 981,
      "')": 982,
      "cance": 983,
      "ac": 984,
      " ℤ": 985,
      "dv": 986,
      "sure": 987,
      "ction.": 988,
      " (P": 989,
      "integral_": 990,
      "ity": 991,
      "Fin": 992,
      "At": 993,
      " Co": 994,
      "iff]\n": 995,
      " map_": 996,
      ".s": 997,
      " hg": 998,
      "₂)": 999,
      "inser": 1000,
      " ↑(": 1001,
      "Comp": 1002,
      " is": 1003,
      "ker": 1004,
      "ab": 1005,
      " _).": 1006,
      " Or": 1007,
      "_eq": 1008,
      "prod": 1009,
      "Comple": 1010,
      " (L": 1011,
      " Con": 1012,
      "ol": 1013,
      "Finse": 1014,
      " Re": 1015,
      "all_": 1016,
      "oryTheory.": 1017,
      "le_of_": 1018,
      "op": 1019,
      " (r": 1020,
      ".f": 1021,
      "assoc,": 1022,
      " CategoryTheory.": 1023,
      "olynomial.": 1024,
      " a)": 1025,
      "lgebra": 1026,
      " hc": 1027,
      " zero_": 1028,
      "Space": 1029,
      " hm": 1030,
      " this\n": 1031,
      " (by": 1032,
      "_in": 1033,
      " ?_⟩\n": 1034,
      ".b": 1035,
      "'\n": 1036,
      ".is": 1037,
      "zero]\n": 1038,
      " Q": 1039,
      " Finset": 1040,
      "actor": 1041,
      "hds": 1042,
      "ang": 1043,
      " F)": 1044,
      " J": 1045,
      " ENNReal.": 1046,
      "_iff_": 1047,
      "Top": 1048,
      " List.": 1049,
      " ≠": 1050,
      "Real": 1051,
      "ur": 1052,
      "inearMap.": 1053,
      "am": 1054,
      "vert": 1055,
      "ow": 1056,
      "iUnion": 1057,
      "der": 1058,
      " :=\n": 1059,
      " MeasureTheory.": 1060,
      " to": 1061,
      "nonneg": 1062,
      " ih": 1063,
      "two": 1064,
      "t_of_": 1065,
      " one_": 1066,
      "ng": 1067,
      "ef": 1068,
      " h₁": 1069,
      "max": 1070,
      "roup": 1071,
      "cast": 1072,
      "by_": 1073,
      "norm_": 1074,
      "oun": 1075,
      "deriv": 1076,
      "ter": 1077,
      "one,": 1078,
      " b)": 1079,
      "induction": 1080,
      "≥0": 1081,
      "mul]\n": 1082,
      "ted": 1083,
      " not_": 1084,
      "add,": 1085,
      "⟩,": 1086,
      "_ne_": 1087,
      " s)": 1088,
      " h_": 1089,
      " co": 1090,
      " G)": 1091,
      " norm": 1092,
      "ent": 1093,
      "Degre": 1094,
      " ×": 1095,
      "Open": 1096,
      " φ": 1097,
      " ℝ≥0": 1098,
      "per": 1099,
      "hea": 1100,
      " f)": 1101,
      "₁)": 1102,
      "din": 1103,
      " X)": 1104,
      "rwa": 1105,
      " (e": 1106,
      "_non": 1107,
      "rim": 1108,
      " U": 1109,
      "tendsto_": 1110,
      "ux": 1111,
      " Fun": 1112,
      "val_": 1113,
      "aliz": 1114,
      " ε": 1115,
      ".mem_": 1116,
      " ℤ)": 1117,
      " Z": 1118,
      "range_": 1119,
      " Real.": 1120,
      "eq,": 1121,
      "se_": 1122,
      "_apply,": 1123,
      "Set": 1124,
      "])": 1125,
      " hr": 1126,
      "rime": 1127,
      ".coe_": 1128,
      " s,": 1129,
      "rable_": 1130,
      "Real_": 1131,
      " re": 1132,
      "inter_": 1133,
      "algebraMap": 1134,
      " x\n": 1135,
      "_le_": 1136,
      "Mo": 1137,
      " eq_": 1138,
      "dinal.": 1139,
      "Clo": 1140,
      " Submodule": 1141,
      "rank": 1142,
      "cal": 1143,
      "strict": 1144,
      "''": 1145,
      "set.": 1146,
      "Ring": 1147,
      " hx\n": 1148,
      "apply,": 1149,
      "alize": 1150,
      "t_eq_": 1151,
      "nd": 1152,
      " (𝕜": 1153,
      "comm,": 1154,
      " (v": 1155,
      "pl": 1156,
      " h₂": 1157,
      " un": 1158,
      "₁,": 1159,
      "Measure": 1160,
      "for": 1161,
      "cle": 1162,
      "tra": 1163,
      " (K": 1164,
      "union": 1165,
      " (k": 1166,
      "obj": 1167,
      "sed": 1168,
      ").symm": 1169,
      " neg": 1170,
      " ⟨h": 1171,
      ".con": 1172,
      "olog": 1173,
      ".e": 1174,
      "ae": 1175,
      " Filter": 1176,
      " ∘": 1177,
      ".le": 1178,
      "ight": 1179,
      "ually": 1180,
      " [mem_": 1181,
      " rfl⟩\n": 1182,
      "imple": 1183,
      " List": 1184,
      " Int.": 1185,
      "us_": 1186,
      " V)": 1187,
      " ℂ": 1188,
      "cha": 1189,
      " γ": 1190,
      " (↑": 1191,
      " exists_": 1192,
      " Matri": 1193,
      " ∂": 1194,
      "inter": 1195,
      "ig": 1196,
      "vent": 1197,
      "finite": 1198,
      "by_cases": 1199,
      "be": 1200,
      "p)": 1201,
      "neg_": 1202,
      "t,": 1203,
      "Unit": 1204,
      "5)": 1205,
      "pli": 1206,
      "dvd_": 1207,
      ".comp": 1208,
      "asis": 1209,
      "})": 1210,
      ".trans": 1211,
      "self_": 1212,
      "ventually": 1213,
      "rie": 1214,
      "ne_zero": 1215,
      "cat": 1216,
      " Multi": 1217,
      "Sup": 1218,
      "equ": 1219,
      "left_": 1220,
      " smul_": 1221,
      "sup": 1222,
      "get": 1223,
      "pos_": 1224,
      "d,": 1225,
      " y)": 1226,
      "subset": 1227,
      " Polynomial.": 1228,
      " u_5)": 1229,
      "convert": 1230,
      "ull": 1231,
      " (-": 1232,
      "uoti": 1233,
      "At_": 1234,
      "Set.": 1235,
      "den": 1236,
      "has": 1237,
      " o": 1238,
      "right_": 1239,
      "nhds": 1240,
      "Loc": 1241,
      " h,": 1242,
      "deal.": 1243,
      " =>\n": 1244,
      "iform": 1245,
      " _)\n": 1246,
      " hz": 1247,
      "ngth": 1248,
      "Pre": 1249,
      " s.": 1250,
      " [mul_": 1251,
      " A)": 1252,
      "ed": 1253,
      "ext\n": 1254,
      "_iff": 1255,
      "tru": 1256,
      " hu": 1257,
      "ilter_": 1258,
      "ffine": 1259,
      "_mul_": 1260,
      " rfl\n": 1261,
      " Continuous": 1262,
      " Function.": 1263,
      "congr_": 1264,
      "las": 1265,
      "Or": 1266,
      "ructor": 1267,
      "[X": 1268,
      "constructor": 1269,
      " 2)": 1270,
      "rom": 1271,
      " P)": 1272,
      "comm]\n": 1273,
      "span": 1274,
      "able": 1275,
      " (u": 1276,
      " i,": 1277,
      "ag": 1278,
      "e,": 1279,
      " ab": 1280,
      " Prop)": 1281,
      "ast": 1282,
      " (Y": 1283,
      " Comple": 1284,
      " σ": 1285,
      "']\n": 1286,
      " coe_": 1287,
      "ant": 1288,
      "ry": 1289,
      "∞)": 1290,
      ".mpr": 1291,
      " ∫": 1292,
      "Lef": 1293,
      " (B": 1294,
      "nd_": 1295,
      "raph": 1296,
      " rfl⟩": 1297,
      "nti": 1298,
      "ct_": 1299,
      "ari": 1300,
      " ⊆": 1301,
      " simpa": 1302,
      "pply": 1303,
      "dicat": 1304,
      " (z": 1305,
      "degre": 1306,
      "Cha": 1307,
      "a,": 1308,
      "nel": 1309,
      "bi": 1310,
      "ou": 1311,
      " hk": 1312,
      "tinuous_": 1313,
      " (1": 1314,
      " Ten": 1315,
      "heaf": 1316,
      " apply": 1317,
      " ⥤": 1318,
      " Measurable": 1319,
      " div": 1320,
      "one]\n": 1321,
      ".mk": 1322,
      "erm": 1323,
      ")]\n": 1324,
      " ∂μ": 1325,
      "cancel": 1326,
      " ∩": 1327,
      "Serie": 1328,
      "ack": 1329,
      "grable": 1330,
      "ke": 1331,
      "neg,": 1332,
      "alization": 1333,
      "'_": 1334,
      "ner": 1335,
      " have": 1336,
      "dex": 1337,
      " (Nat.": 1338,
      "duct": 1339,
      "'.": 1340,
      "ring": 1341,
      "closure": 1342,
      " h.": 1343,
      "deal": 1344,
      " Y)": 1345,
      " ⟨fun": 1346,
      " ∑": 1347,
      "dding": 1348,
      "smul": 1349,
      "bedding": 1350,
      " ↥": 1351,
      "Eq": 1352,
      " (H": 1353,
      " sub_": 1354,
      "e_of_": 1355,
      "succ_": 1356,
      "rate": 1357,
      "cancel_": 1358,
      "sup_": 1359,
      "tri": 1360,
      "tiv": 1361,
      "ces": 1362,
      "ical": 1363,
      "₂,": 1364,
      " f.": 1365,
      "c.": 1366,
      "Sum": 1367,
      "exp": 1368,
      "dist": 1369,
      "onoid": 1370,
      "Uni": 1371,
      " of": 1372,
      "lgebra.": 1373,
      "arti": 1374,
      "Of_": 1375,
      "_,": 1376,
      "gral": 1377,
      "Ab": 1378,
      " S)": 1379,
      " map": 1380,
      " (N": 1381,
      "at_": 1382,
      "congr\n": 1383,
      "[X])": 1384,
      " (hf": 1385,
      " Simple": 1386,
      "constructor\n": 1387,
      "y,": 1388,
      "Complex": 1389,
      " 0)": 1390,
      "def,": 1391,
      "Icc": 1392,
      "Lim": 1393,
      "insert": 1394,
      " ℝ≥0∞)": 1395,
      " ℂ)": 1396,
      " @": 1397,
      "intype": 1398,
      " (V": 1399,
      " _,": 1400,
      " K)": 1401,
      "comp,": 1402,
      " neg_": 1403,
      "rase": 1404,
      "joint_": 1405,
      " h'": 1406,
      "Diff": 1407,
      " LinearMap.": 1408,
      "min": 1409,
      "easurable_": 1410,
      " ⇑": 1411,
      "sub_eq_": 1412,
      " n,": 1413,
      "easure_": 1414,
      "sion": 1415,
      " ⟨x,": 1416,
      "back": 1417,
      "ff_": 1418,
      "ift_": 1419,
      "suppor": 1420,
      " ?_,": 1421,
      "coeff_": 1422,
      "old": 1423,
      "ron": 1424,
      "ullback": 1425,
      " p)": 1426,
      " p.": 1427,
      "imp": 1428,
      "Measurable": 1429,
      " δ": 1430,
      "lift": 1431,
      "ology": 1432,
      " }": 1433,
      "iel": 1434,
      "e_eq_": 1435,
      " π": 1436,
      "nge": 1437,
      "ounde": 1438,
      " pow_": 1439,
      " Tendsto": 1440,
      "i.": 1441,
      "dsimp": 1442,
      "coun": 1443,
      "smul,": 1444,
      "_nonneg": 1445,
      "sor": 1446,
      "hd": 1447,
      "Finite": 1448,
      "Finset.": 1449,
      "ycle": 1450,
      "sig": 1451,
      " w)": 1452,
      "Submodule": 1453,
      " [s": 1454,
      "wap": 1455,
      " hj": 1456,
      "root": 1457,
      " x,": 1458,
      "sur": 1459,
      "verse": 1460,
      " hq": 1461,
      "On_": 1462,
      " ''": 1463,
      " ⟨⟨": 1464,
      "equiv": 1465,
      " intro": 1466,
      " c)": 1467,
      "Norm": 1468,
      "Mul": 1469,
      " hv": 1470,
      "FDeriv": 1471,
      "_left": 1472,
      " Has": 1473,
      " ⁻¹": 1474,
      "tive": 1475,
      " Ω": 1476,
      "ame": 1477,
      " ⋯": 1478,
      "[R": 1479,
      "subtype": 1480,
      "art": 1481,
      " Ordinal.": 1482,
      "etri": 1483,
      "_le": 1484,
      "i,": 1485,
      "suff": 1486,
      ").2": 1487,
      "Add": 1488,
      " (q": 1489,
      "continuous": 1490,
      "trans_": 1491,
      "suffi": 1492,
      "{u": 1493,
      " h]\n": 1494,
      "s\n": 1495,
      "Right": 1496,
      "inj": 1497,
      "Functor": 1498,
      "hds_": 1499,
      "b,": 1500,
      "onempty": 1501,
      "ero": 1502,
      "Multi": 1503,
      " ⟨_,": 1504,
      "p,": 1505,
      "dicator": 1506,
      " ⁻¹'": 1507,
      "_ne_zero": 1508,
      "cases'": 1509,
      " 1\n": 1510,
      "tation": 1511,
      " g)": 1512,
      "Matri": 1513,
      " n\n": 1514,
      "[R]": 1515,
      "s]\n": 1516,
      "Aux": 1517,
      "war": 1518,
      "Left": 1519,
      ").to": 1520,
      " (j": 1521,
      "suffices": 1522,
      "filter_": 1523,
      "map,": 1524,
      " ⊤": 1525,
      "posi": 1526,
      "dist_": 1527,
      " refine": 1528,
      "const_": 1529,
      "Sup_": 1530,
      "intype.": 1531,
      "Zero": 1532,
      " (𝓝": 1533,
      "row": 1534,
      "finrank": 1535,
      "Hom.": 1536,
      " dis": 1537,
      "joint": 1538,
      "sedB": 1539,
      "lin": 1540,
      " i\n": 1541,
      "polog": 1542,
      "group": 1543,
      "contra": 1544,
      "mbedding": 1545,
      "ssoc": 1546,
      "injective": 1547,
      " (φ": 1548,
      "n_": 1549,
      "1,": 1550,
      "choo": 1551,
      "ure": 1552,
      "support": 1553,
      "Graph": 1554,
      "ere": 1555,
      "c\n": 1556,
      "assoc]\n": 1557,
      " (w": 1558,
      "Ico": 1559,
      " (D": 1560,
      "Set_": 1561,
      "length": 1562,
      "coe,": 1563,
      "fal": 1564,
      "uotien": 1565,
      "diff": 1566,
      "eq]\n": 1567,
      "bot": 1568,
      " (γ": 1569,
      " [Nat.": 1570,
      " and_": 1571,
      "vP": 1572,
      " Multiset.": 1573,
      "itt": 1574,
      "lt_of_": 1575,
      "natDegre": 1576,
      ".Is": 1577,
      "id_": 1578,
      " Matrix.": 1579,
      "prime": 1580,
      "orph": 1581,
      "_eq_zero": 1582,
      " Complex.": 1583,
      "atTop": 1584,
      " Mo": 1585,
      "rong": 1586,
      ".eq_": 1587,
      " hd": 1588,
      "strict_": 1589,
      " hl": 1590,
      "oi": 1591,
      " (mem_": 1592,
      "_right": 1593,
      "then": 1594,
      " Subtype": 1595,
      "Nat": 1596,
      "ance": 1597,
      " [this": 1598,
      "c,": 1599,
      " t)": 1600,
      " pro": 1601,
      "lassi": 1602,
      ").trans": 1603,
      "appen": 1604,
      "tic": 1605,
      "ace": 1606,
      "angle_": 1607,
      "Complex.": 1608,
      "sity": 1609,
      "actori": 1610,
      " 𝕜)": 1611,
      ".co": 1612,
      "sq": 1613,
      " [add_": 1614,
      "Inde": 1615,
      "preimage_": 1616,
      "diff_": 1617,
      "Inf": 1618,
      "succ,": 1619,
      " [L": 1620,
      "inf": 1621,
      "pow,": 1622,
      "induction'": 1623,
      "conv": 1624,
      " SimpleGraph": 1625,
      " h2": 1626,
      " 3": 1627,
      "single": 1628,
      "coeff": 1629,
      "erenti": 1630,
      "Cast": 1631,
      "ck": 1632,
      ").1": 1633,
      "n,": 1634,
      "_num": 1635,
      "Embedding": 1636,
      "lg": 1637,
      "onal": 1638,
      " hab": 1639,
      "eom": 1640,
      "prim": 1641,
      " Nat.cast_": 1642,
      " R[X])": 1643,
      "tivity": 1644,
      "isymm": 1645,
      "sub,": 1646,
      "root_": 1647,
      "compl_": 1648,
      " [Finset.": 1649,
      "que": 1650,
      "antisymm": 1651,
      " B)": 1652,
      " ω": 1653,
      " Ring": 1654,
      " (W": 1655,
      "mpr": 1656,
      "and_": 1657,
      "monoid": 1658,
      "positivity": 1659,
      "choose": 1660,
      "poly": 1661,
      "pi_": 1662,
      "rt": 1663,
      "Limit": 1664,
      ".hom": 1665,
      " j)": 1666,
      " ▸": 1667,
      "_nat": 1668,
      "s_of_": 1669,
      "Po": 1670,
      "ega": 1671,
      ".m": 1672,
      "supp.": 1673,
      " Lie": 1674,
      "ise": 1675,
      " ima": 1676,
      " ?_)\n": 1677,
      " k)": 1678,
      "Seq": 1679,
      "date": 1680,
      "0,": 1681,
      " (d": 1682,
      "etry": 1683,
      "Group": 1684,
      ".n": 1685,
      "wards": 1686,
      " (map": 1687,
      "Den": 1688,
      " Ideal.": 1689,
      "rivi": 1690,
      "_1": 1691,
      "omega": 1692,
      "kernel": 1693,
      "upwards": 1694,
      " ⟨a,": 1695,
      "iff]": 1696,
      " α),": 1697,
      "Matrix": 1698,
      " inv_": 1699,
      " mk": 1700,
      "_re": 1701,
      "Ad": 1702,
      "Pa": 1703,
      "raction": 1704,
      " de": 1705,
      "support_": 1706,
      "ext_": 1707,
      "))\n": 1708,
      "ce_": 1709,
      "ome": 1710,
      "ber": 1711,
      " ν": 1712,
      "Uniform": 1713,
      "ption": 1714,
      "gene": 1715,
      " ↑n": 1716,
      "Inf_": 1717,
      " 0\n": 1718,
      " a,": 1719,
      "eta": 1720,
      " univ": 1721,
      " IH": 1722,
      "X_": 1723,
      "dvd": 1724,
      " hw": 1725,
      "bin": 1726,
      "arith": 1727,
      " ⊢": 1728,
      "compl": 1729,
      "arg": 1730,
      "od": 1731,
      "wer": 1732,
      "_pos": 1733,
      "pr": 1734,
      " tru": 1735,
      "Basi": 1736,
      "p.": 1737,
      "tom": 1738,
      "Ten": 1739,
      "⟩⟩\n": 1740,
      "uotient.": 1741,
      "ree": 1742,
      "ular": 1743,
      "filter": 1744,
      " H\n": 1745,
      "add]\n": 1746,
      "order": 1747,
      "rongly": 1748,
      "tar": 1749,
      "how": 1750,
      ".succ": 1751,
      " clo": 1752,
      " →ₗ": 1753,
      " lt_": 1754,
      "Ioc": 1755,
      "uni": 1756,
      "sedBall": 1757,
      " ⊢\n": 1758,
      "rpow_": 1759,
      " hxy": 1760,
      ".obj": 1761,
      "Localization": 1762,
      " b,": 1763,
      " dist": 1764,
      " (Fin": 1765,
      "apply_": 1766,
      "main": 1767,
      " γ)": 1768,
      "6)": 1769,
      " for": 1770,
      " Set.mem_": 1771,
      "disjoint_": 1772,
      " ∨": 1773,
      "Density": 1774,
      "Ro": 1775,
      "pos.": 1776,
      "eval": 1777,
      " [Set.": 1778,
      "erase": 1779,
      "dule.": 1780,
      "el": 1781,
      " (le_": 1782,
      " [f": 1783,
      ").hom": 1784,
      "sheaf": 1785,
      " 1))": 1786,
      "Product": 1787,
      "pect": 1788,
      "forall_": 1789,
      "plit": 1790,
      " (σ": 1791,
      "haveI": 1792,
      "lu": 1793,
      "cons,": 1794,
      ".of_": 1795,
      " ::": 1796,
      " u_6)": 1797,
      " i))": 1798,
      "Monoid": 1799,
      "₂_": 1800,
      "Ex": 1801,
      "erentiable": 1802,
      "ush": 1803,
      "Tran": 1804,
      "Basis": 1805,
      " MvP": 1806,
      "preimage": 1807,
      " D)": 1808,
      "use": 1809,
      "multi": 1810,
      "ounded": 1811,
      "mon": 1812,
      "change": 1813,
      "ae_": 1814,
      " (Q": 1815,
      "Li": 1816,
      "gc": 1817,
      "left,": 1818,
      "omm": 1819,
      ").symm\n": 1820,
      "_singleton": 1821,
      " L)": 1822,
      " Equiv": 1823,
      " (J": 1824,
      " tendsto_": 1825,
      "le,": 1826,
      " norm_": 1827,
      "au": 1828,
      "gen": 1829,
      ".ne": 1830,
      "ase": 1831,
      "_apply]\n": 1832,
      " with\n": 1833,
      "forall": 1834,
      " Matrix": 1835,
      " ¬": 1836,
      "Like": 1837,
      "nn": 1838,
      "unit": 1839,
      " hs\n": 1840,
      " u₁)": 1841,
      "hift": 1842,
      " (o": 1843,
      "Integral_": 1844,
      " (_": 1845,
      "no": 1846,
      "apply]\n": 1847,
      "sc": 1848,
      " h1": 1849,
      " Hom": 1850,
      " ≃": 1851,
      " hP": 1852,
      " ⟨i,": 1853,
      " sum_": 1854,
      " (algebraMap": 1855,
      " (2": 1856,
      "ord": 1857,
      "Succ": 1858,
      "Inter": 1859,
      "lse": 1860,
      "exp_": 1861,
      "_subset_": 1862,
      "Form": 1863,
      "erw": 1864,
      " (con": 1865,
      "mod_": 1866,
      " ⊗": 1867,
      "omain": 1868,
      "diag": 1869,
      "eq_zero": 1870,
      " Sort": 1871,
      "inv,": 1872,
      "nec": 1873,
      "ast_": 1874,
      " Fintype.": 1875,
      "place": 1876,
      " ?_)": 1877,
      " simp\n": 1878,
      "le_of_lt": 1879,
      "pose": 1880,
      "hain": 1881,
      " i).": 1882,
      "_self": 1883,
      " ↥(": 1884,
      "];": 1885,
      "ss": 1886,
      " ∣": 1887,
      " 𝓝": 1888,
      " then": 1889,
      " m)": 1890,
      "ardinal.": 1891,
      " (Z": 1892,
      "f_pos": 1893,
      " (Set.": 1894,
      "_add_": 1895,
      "₁₂": 1896,
      "exten": 1897,
      " f'": 1898,
      ".exists_": 1899,
      "ale": 1900,
      "aux": 1901,
      "update": 1902,
      " \\": 1903,
      "rated": 1904,
      " (Finse": 1905,
      "power": 1906,
      " Pi.": 1907,
      " hx,": 1908,
      " N)": 1909,
      " else": 1910,
      " →+": 1911,
      " atTop": 1912,
      "ofReal": 1913,
      "Series": 1914,
      " ℚ": 1915,
      "nonempty": 1916,
      "fold": 1917,
      "ner_": 1918,
      " ∪": 1919,
      "Ob": 1920,
      "ofReal_": 1921,
      " ∏": 1922,
      "Continuous": 1923,
      "etric": 1924,
      " t,": 1925,
      "Compact": 1926,
      ".app": 1927,
      "rpow": 1928,
      "₀,": 1929,
      "Int.": 1930,
      " di": 1931,
      "Homology": 1932,
      "hs": 1933,
      " hU": 1934,
      ".restrict": 1935,
      " hf\n": 1936,
      "₁.": 1937,
      "alk": 1938,
      "surjective": 1939,
      "mem_nhds": 1940,
      " he": 1941,
      "Ideal": 1942,
      " mul_assoc,": 1943,
      "Close": 1944,
      "WithinAt": 1945,
      " n).": 1946,
      " ⟨y,": 1947,
      "setOf_": 1948,
      "iate": 1949,
      "_f": 1950,
      " (T": 1951,
      "prime_": 1952,
      "cycle": 1953,
      " range": 1954,
      "it.": 1955,
      "open": 1956,
      " Linear": 1957,
      "plit_": 1958,
      "Equiv.": 1959,
      " (0": 1960,
      "insert_": 1961,
      "Finset": 1962,
      "linear": 1963,
      " t.": 1964,
      "Fiel": 1965,
      " x))": 1966,
      "star": 1967,
      " hy\n": 1968,
      "filter_upwards": 1969,
      "integral": 1970,
      "act_": 1971,
      " rwa": 1972,
      " r)": 1973,
      "Div": 1974,
      " ‖f": 1975,
      ".inr": 1976,
      "artial": 1977,
      "v,": 1978,
      "ector": 1979,
      "top_": 1980,
      " ⊥": 1981,
      " (norm": 1982,
      ".mono": 1983,
      " card_": 1984,
      "jectiv": 1985,
      "ower": 1986,
      "₂\n": 1987,
      " [map_": 1988,
      " (is": 1989,
      " κ": 1990,
      "comp]\n": 1991,
      "Val": 1992,
      " Add": 1993,
      "bot_": 1994,
      "ip": 1995,
      " pre": 1996,
      "univ,": 1997,
      "angle": 1998,
      "mea": 1999,
      "eq_of_": 2000,
      "Indepen": 2001,
      "f,": 2002,
      "lift_": 2003,
      " Cardinal.": 2004,
      " if": 2005,
      "Closure": 2006,
      "with": 2007,
      " x‖": 2008,
      "cons_": 2009,
      "Cast_": 2010,
      " {x": 2011,
      " →+*": 2012,
      "ventually_": 2013,
      "degree_": 2014,
      " a\n": 2015,
      "cons": 2016,
      "rum": 2017,
      "pectrum": 2018,
      "rec": 2019,
      "plit_if": 2020,
      "Algebra": 2021,
      "mk,": 2022,
      " inter_": 2023,
      " x).": 2024,
      "_lt_": 2025,
      "Num": 2026,
      " min": 2027,
      "At.": 2028,
      "inf_": 2029,
      " Subgroup": 2030,
      "Span": 2031,
      "div,": 2032,
      "comp_apply,": 2033,
      ".inl": 2034,
      "hort": 2035,
      "hom_": 2036,
      "adjoin": 2037,
      ".1,": 2038,
      "d]\n": 2039,
      "pec": 2040,
      "pos_of_": 2041,
      " hI": 2042,
      " ite": 2043,
      "swap": 2044,
      " comp_": 2045,
      "calar": 2046,
      "interi": 2047,
      " forall_": 2048,
      "Topolog": 2049,
      " hn\n": 2050,
      " [e": 2051,
      "ingCo": 2052,
      "_b": 2053,
      "olu": 2054,
      ")).": 2055,
      "right,": 2056,
      "refl": 2057,
      "ool": 2058,
      "replace": 2059,
      "Domain": 2060,
      "uotient": 2061,
      "Order": 2062,
      "le\n": 2063,
      " prod_": 2064,
      "Categ": 2065,
      " [h]\n": 2066,
      "L[": 2067,
      " Finset.sum_": 2068,
      " [P": 2069,
      " eval": 2070,
      "Within_": 2071,
      " (Finset.": 2072,
      "false": 2073,
      "itz": 2074,
      "Mod": 2075,
      "uniform": 2076,
      "ological": 2077,
      "iSup": 2078,
      "toL": 2079,
      "stance": 2080,
      "le_iff_": 2081,
      "lintegral_": 2082,
      " hμ": 2083,
      "Integral": 2084,
      " Fin.": 2085,
      "ring\n": 2086,
      "tho": 2087,
      "trivi": 2088,
      "abs_": 2089,
      "io": 2090,
      " from": 2091,
      "j,": 2092,
      "adic": 2093,
      " (in": 2094,
      "easurableSet_": 2095,
      " hS": 2096,
      "smul]\n": 2097,
      "neg]\n": 2098,
      "aco": 2099,
      "split_if": 2100,
      "ut": 2101,
      "vex": 2102,
      "mod": 2103,
      " Ordinal.{u": 2104,
      " integral_": 2105,
      "cide": 2106,
      "redu": 2107,
      "at)": 2108,
      "congr_arg": 2109,
      " eq": 2110,
      "tal": 2111,
      "Function.": 2112,
      ".p": 2113,
      " Algebra.": 2114,
      " hi\n": 2115,
      "def]\n": 2116,
      "ronglyMeasurable": 2117,
      "ata": 2118,
      "Hom.map_": 2119,
      "Abo": 2120,
      "tDiff": 2121,
      "ix": 2122,
      "limit": 2123,
      " Option": 2124,
      "plic": 2125,
      " Subtype.": 2126,
      "Rel": 2127,
      " max": 2128,
      "ound": 2129,
      ".2\n": 2130,
      "olynomial": 2131,
      "Factor": 2132,
      "_eq_of_": 2133,
      " Finset.mem_": 2134,
      " _root_": 2135,
      " subset_": 2136,
      " abs_": 2137,
      " ⊓": 2138,
      ".fst": 2139,
      "subst": 2140,
      "r,": 2141,
      " H)": 2142,
      ".elim": 2143,
      "Prime": 2144,
      " Ω)": 2145,
      " ⊔": 2146,
      " has": 2147,
      " ha\n": 2148,
      " ring": 2149,
      "Scalar": 2150,
      "m,": 2151,
      "amma": 2152,
      ".a": 2153,
      "No": 2154,
      "ute": 2155,
      "trict": 2156,
      "1\n": 2157,
      "s)": 2158,
      "sin": 2159,
      " ⟨n,": 2160,
      "Ar": 2161,
      " (⇑": 2162,
      " Finsupp.": 2163,
      "eight": 2164,
      " [(": 2165,
      " [h,": 2166,
      " hε": 2167,
      ".mul_": 2168,
      ".of": 2169,
      "degree": 2170,
      " h)": 2171,
      "_eq_zero_": 2172,
      "Perm": 2173,
      "Algebra.": 2174,
      " le_antisymm": 2175,
      " image_": 2176,
      "7)": 2177,
      "ve_": 2178,
      "Ioo": 2179,
      "positivity\n": 2180,
      ".comp_": 2181,
      "ange": 2182,
      "omial": 2183,
      " ×ˢ": 2184,
      "ility": 2185,
      " log": 2186,
      " NN": 2187,
      "adingCo": 2188,
      "id,": 2189,
      "le_mul_": 2190,
      "_of_le": 2191,
      " sub_eq_": 2192,
      "_mem": 2193,
      "map]\n": 2194,
      " ∅": 2195,
      "nhds_": 2196,
      " f\n": 2197,
      " ∫⁻": 2198,
      "self,": 2199,
      "inci": 2200,
      ".toL": 2201,
      "lock": 2202,
      "integrable": 2203,
      "ami": 2204,
      " h)\n": 2205,
      "incip": 2206,
      "isor": 2207,
      "ist_": 2208,
      " ofReal_": 2209,
      "grable_": 2210,
      " continuous_": 2211,
      "Ioi": 2212,
      " f).": 2213,
      "eve": 2214,
      " y,": 2215,
      "cen": 2216,
      "Trans": 2217,
      " u_7)": 2218,
      " nat": 2219,
      "Tensor": 2220,
      " z)": 2221,
      "p\n": 2222,
      " (U": 2223,
      "Subtype": 2224,
      "zation": 2225,
      "irw": 2226,
      "calc\n": 2227,
      "amily": 2228,
      " y\n": 2229,
      "Inv": 2230,
      "restrict": 2231,
      "lower": 2232,
      "lt_one": 2233,
      " [eq_": 2234,
      "ernel": 2235,
      " Pre": 2236,
      " hij": 2237,
      "onic": 2238,
      "biUnion": 2239,
      " (π": 2240,
      "indicator": 2241,
      "Elem": 2242,
      "artition": 2243,
      ".symm\n": 2244,
      "_iff,": 2245,
      "tone": 2246,
      " hT": 2247,
      " hs.": 2248,
      "ability": 2249,
      "natDegree": 2250,
      "₂.": 2251,
      " Bool": 2252,
      "omega\n": 2253,
      "del": 2254,
      "Closed_": 2255,
      " [i": 2256,
      ".length": 2257,
      " Comp": 2258,
      " →ₗ[R]": 2259,
      " Category.": 2260,
      "ym": 2261,
      " (rfl": 2262,
      "rier": 2263,
      " span": 2264,
      "ssociate": 2265,
      " ext": 2266,
      "bability": 2267,
      "smul_eq_": 2268,
      "iterate": 2269,
      "Cur": 2270,
      " Ideal": 2271,
      "alized": 2272,
      " coeff_": 2273,
      "fst": 2274,
      " fin": 2275,
      " f,": 2276,
      "zero]": 2277,
      " [is": 2278,
      " ha,": 2279,
      " Prod.": 2280,
      " Module.": 2281,
      "Root": 2282,
      " x.": 2283,
      "Open_": 2284,
      "u,": 2285,
      " S.": 2286,
      " closure": 2287,
      "k,": 2288,
      "ser": 2289,
      " Submonoid": 2290,
      "Sem": 2291,
      "split_ifs": 2292,
      "rat": 2293,
      "Func": 2294,
      " NNReal.": 2295,
      " Affine": 2296,
      "oangle_": 2297,
      " (Is": 2298,
      "cate": 2299,
      " I)": 2300,
      "_on": 2301,
      "mk_": 2302,
      "By": 2303,
      "eme": 2304,
      "f_neg": 2305,
      " sq": 2306,
      " [pow_": 2307,
      " Homological": 2308,
      "od_": 2309,
      "rn": 2310,
      " ‖x": 2311,
      "Iic": 2312,
      "eff": 2313,
      "Nonempty": 2314,
      "WithinAt_": 2315,
      " τ": 2316,
      "_symm": 2317,
      " Inte": 2318,
      "le_add_": 2319,
      "𝕜]": 2320,
      " (∀": 2321,
      "ram": 2322,
      " With": 2323,
      "ary": 2324,
      "Iso_": 2325,
      "distri": 2326,
      "Degree_": 2327,
      "Measure.": 2328,
      " (mul_": 2329,
      " Coc": 2330,
      "acobi": 2331,
      "imal": 2332,
      "Integr": 2333,
      " ℝ≥0)": 2334,
      "norm_num": 2335,
      " id": 2336,
      "tail": 2337,
      "right]\n": 2338,
      "lassical": 2339,
      " Equiv.": 2340,
      "jective_": 2341,
      " a.": 2342,
      "conj": 2343,
      ")))": 2344,
      "cast\n": 2345,
      "ax": 2346,
      "eval_": 2347,
      " hf.": 2348,
      "div_two": 2349,
      " Z)": 2350,
      "Limits.": 2351,
      "dual": 2352,
      "Unit_": 2353,
      "closedBall": 2354,
      "out": 2355,
      "X,": 2356,
      "comap_": 2357,
      ").comp": 2358,
      " Multiset": 2359,
      "Big": 2360,
      "BigO": 2361,
      " ⋃": 2362,
      " Int.cast_": 2363,
      "tomic": 2364,
      "reduci": 2365,
      "eometry": 2366,
      "itive": 2367,
      " h0": 2368,
      "_norm": 2369,
      " Cochain": 2370,
      "gt": 2371,
      "natAb": 2372,
      "withDensity": 2373,
      "here": 2374,
      "cli": 2375,
      "_of_is": 2376,
      "isjoint": 2377,
      "sum,": 2378,
      " ⨆": 2379,
      "Geometry": 2380,
      "left]\n": 2381,
      "Units.": 2382,
      "iff.2": 2383,
      "Bot": 2384,
      "his": 2385,
      "seq": 2386,
      "table": 2387,
      "g,": 2388,
      "_of_mem": 2389,
      " hJ": 2390,
      "Alg": 2391,
      " (ε": 2392,
      "ortho": 2393,
      " →L[": 2394,
      "duce": 2395,
      "St": 2396,
      " n.": 2397,
      "ngle": 2398,
      " s).": 2399,
      " inf": 2400,
      "ural": 2401,
      "Category.": 2402,
      " η": 2403,
      " St": 2404,
      " Nat.add_": 2405,
      "top,": 2406,
      " CategoryTheory.Limits.": 2407,
      " Filter.": 2408,
      "classical": 2409,
      "Prod": 2410,
      " ContinuousL": 2411,
      "ᵒᵖ": 2412,
      "osi": 2413,
      " _),": 2414,
      " rfl,": 2415,
      " Integrable": 2416,
      "₀)": 2417,
      "From": 2418,
      "pair": 2419,
      "desc": 2420,
      " ge": 2421,
      " finrank": 2422,
      "yclo": 2423,
      " measure_": 2424,
      "cheme": 2425,
      "generate": 2426,
      "yclotomic": 2427,
      " pullback": 2428,
      "chain": 2429,
      "alizer": 2430,
      "cur": 2431,
      "z,": 2432,
      " Submodule.": 2433,
      "ox": 2434,
      ").inv": 2435,
      "orphis": 2436,
      "Id": 2437,
      "product": 2438,
      " hb\n": 2439,
      "Mono": 2440,
      " (co": 2441,
      " G.": 2442,
      "orphism": 2443,
      "Nat_": 2444,
      "Type": 2445,
      " eq_or_": 2446,
      "ual": 2447,
      "sour": 2448,
      "linarith": 2449,
      " 4": 2450,
      "hisker": 2451,
      " b\n": 2452,
      " u_1": 2453,
      " x✝": 2454,
      "of_mem": 2455,
      "single_": 2456,
      " ↑x": 2457,
      " hs,": 2458,
      " Functor": 2459,
      " congr_arg": 2460,
      "measure_": 2461,
      "entation": 2462,
      " [this]\n": 2463,
      ".trans_": 2464,
      " α))": 2465,
      "iff_eq_": 2466,
      "RingHom": 2467,
      "cal.": 2468,
      " sing": 2469,
      "Supp": 2470,
      " [E": 2471,
      "_eq_mul_": 2472,
      " Algebra": 2473,
      "_eq,": 2474,
      " ih\n": 2475,
      "eomorph": 2476,
